СтандартнаяОбработка = ложь;

п = новый Структура ();

// Объект: объект метаданных поля, в котором происходит выбор. Пример: Мета.Справочники.Номенклатура
п.Вставить ( "Объект" );

// Поиск: значение поля. Пример: "Клавиатура"
п.Вставить ( "Поиск" );

// СценарийСоздания: путь к сценарию создания объекта в случае, если выбираемое
// в поле значение не будет найдено.
// По умолчанию, данный путь формируется по такому соглашению:
// <ТипОбъекта>.<Имя>.Создать
// Пример: "Справочники.Номенклатура.Создать"
п.Вставить ( "СценарийСоздания" );

// ПараметрыСоздания: структура параметров, которая будет передана сценарию создания элемента
п.Вставить ( "ПараметрыСоздания" );

// Выбрать (умолчание: истина): признак, задающий действия выбора значения в поле
п.Вставить ( "Выбрать", истина );

// БыстрыйВыбор (умолчание: ложь): признак, что в поле производится быстрый выбор
п.Вставить ( "БыстрыйВыбор", ложь );

// Поле: в случае, если БыстрыйВыбор = истина, нужно указать
// поле выбора (предварительно полученное методом Получить ())
п.Вставить ( "Поле" );

возврат п;
