// Проверка работы теста через отчет ЗадолженностьПоставщикам
//
// Параметры:
// Поставщик: наименование поставщика

п = Вызвать ( "Отчеты.ЗадолженностьПоставщикам.Сформировать.Параметры" );
п.Поставщик = _;
форма = Вызвать ( "Отчеты.ЗадолженностьПоставщикам.Сформировать", п );

Здесь ( форма );

// *********************************************
// Ждем, пока отчет сформируется
// *********************************************

осталосьПопыток = 3;
пока ( осталосьПопыток > 0 ) цикл
	заглавие = Взять ( "!ОтчетТабличныйДокумент [R2C1]" );
	отчетСформирован = заглавие = "Задолженность поставщикам";
	если ( отчетСформирован ) тогда
		прервать;
	конецесли;
	Пауза ( 1 );
	осталосьПопыток = осталосьПопыток - 1;
конеццикла;

// *********************************************
// Проверяем по шаблону
// *********************************************

ПроверитьШаблон ( "!ОтчетТабличныйДокумент" );
